# імпортуємо налаштування для відображення емоджі
from .config import KEYBOARD, VERSION, AUTHOR

# відповідь користувачу при відвідуванні блоку "Про магазин"
trading_store = """

<b>Ласкаво просимо до додатку</b>


"""
# відповідь користувачу при відвідуванні блоку "Налаштування"
settings = """
<b>Загальне керівництво додатком:</b>

<i>Навігація:</i>

-<b>({}) - </b><i>назад</i>
-<b>({}) - </b><i>вперед</i>
-<b>({}) - </b><i>збільшити</i>
-<b>({}) - </b><i>зменшити</i>
-<b>({}) - </b><i>наступний</i>
-<b>({}) - </b><i>попередній</i>

<i>Спеціальні кнопки:</i>

-<b>({}) - </b><i>видалити</i>
-<b>({}) - </b><i>замовлення</i>
-<b>({}) - </b><i>Оформити замовлення</i>



""".format(
    KEYBOARD['<<'],
    KEYBOARD['>>'],
    KEYBOARD['UP'],
    KEYBOARD['DOUWN'],
    KEYBOARD['NEXT_STEP'],
    KEYBOARD['BACK_STEP'],
    KEYBOARD['X'],
    KEYBOARD['ORDER'],
    KEYBOARD['APPLAY'],
    VERSION,
    AUTHOR,
    KEYBOARD['COPY'],
)
# відповідь користувачу при додаванні товару до замовлення
product_order = """
Обраний товар:

{}
{}
Вартість: {} грн

додано до замовлення!!!


"""
# відповідь користувачу при відвідуванні блоку з замовленням
order = """

<i>Назва:</i> <b>{}</b>

<i>Опис:</i> <b>{}</b>

<i>Вартість:</i> <b>{} грн за 1 од.</b>

<i>Кількість позицій:</i> <b>{} од.</b> 
"""

order_number = """

<b>Позиція в замовленні № </b> <i>{}</i>

"""
# відповідь користувачу, коли замовлення відсутнє
no_orders = """
<b>Замовлення відсутнє !!!</b>
"""
# відповідь користувачу при підтвердженні оформлення замовлення
applay = """
<b>Ваше замовлення оформлено !!!</b>

<i>Загальна вартість замовлення становить:</i> <b>{} грн</b>

<i>Загальна кількість позицій становить:</i> <b>{} од.</b>

<b>ЗАМОВЛЕННЯ НАПРАВЛЕНО НА СКЛАД,
ДЛЯ ЙОГО КОМПЛЕКТУВАННЯ !!!</b>
"""
# словник відповідей користувачу
MESSAGES = {
    'trading_store': trading_store,
    'product_order': product_order,
    'order': order,
    'order_number': order_number,
    'no_orders': no_orders,
    'applay': applay,
    'settings': settings
}
